{
  "title": "Open Source Vector Database & AI Infrastructure Solutions",
  "desc": "Zilliz engineers are the original creators of some of the world’s most popular open source projects for AI-powered applications. Whether you are building or enhancing your artificial intelligence infrastructure, our Open Source Vector Database and tools are designed to simplify the management and performance of your AI applications.",
  "subTitle": "We are proud to be the maintainers of these popular open source AI infrastructure projects",
  "projects": {
    "title": "We are proud to be the maintainers of these popular open source projects",
    "milvus": {
      "desc": "Milvus is an open source vector database used to store, index, and manage massive embedding vectors generated by deep neural networks and other machine learning (ML) models."
    },
    "towhee": {
      "desc": "Towhee makes it easy to build neural data processing pipelines for AI applications. With hundreds of models, algorithms, and transformations, Towhee helps you encode your unstructured data into embeddings."
    },
    "attu": {
      "desc": "Attu is an open-source management tool for Milvus with an intuitive GUI, allowing you to interact easily with your databases. With just a few clicks, you can visualize your cluster status, manage metadata, perform data queries, and much more."
    },
    "cli": {
      "desc": "Milvus CLI is a command-line tool that supports database connection, data operations, and import and export of data. Based on Milvus Python SDK, it allows the execution of commands through a terminal using interactive command-line prompts."
    },
    "feder": {
      "desc": "Feder is a JavaScript tool designed to aid in comprehending embedding vectors. It visualizes index files from Faiss, HNSWlib, and other ANN libraries to provide insight into how these libraries function."
    },
    "GPTCache": {
      "desc": "GPTCache is an open-source tool designed to improve the efficiency and speed of GPT-based applications by implementing a cache to store the responses generated by language models."
    }
  }
}
