{
  "head": {
    "title": "Milvus Vector Database",
    "subTitle": "What is Milvus?",
    "desc": "Milvus is a highly flexible, reliable, and blazing-fast cloud-native, <0>open-source vector database</0>. It powers embedding similarity search and AI applications and strives to make vector databases accessible to every organization. Milvus can store, index, and manage a billion+ embedding vectors generated by deep neural networks and other machine learning (ML) models.",
    "btnLabel": "Try Zilliz Cloud for free",
    "history": "Milvus was created in 2019 to store, index, and manage massive embedding vectors generated by deep neural networks and other machine learning (ML) models. Zilliz contributed Milvus to the <0>LF AI & Data Foundation</0> as an incubation-stage project and graduated in June 2021. Now, open-source Milvus is the industry’s leading <1>vector database solution.</1>"
  },

  "community": {
    "title": "Built on a strong and growing community.",
    "github": {
      "number": "15,000+",
      "desc": "GitHub stars"
    },
    "slack": {
      "number": "2,000+",
      "desc": "Slack Community"
    },
    "downloads": {
      "number": "2,000,000+",
      "desc": "Downloads"
    },
    "contributors": {
      "number": "2,000+",
      "desc": "Contributors"
    }
  },
  "whyMilvus": {
    "title": "Why Milvus?",
    "desc1": "It is simple to start building a prototype for similarity search, but it is hard to put into production. Embeddings, being highly complex, multi-coordinate numbers, are not well suited to legacy, tabular data structures. Some developers use vector libraries to store vector embeddings in in-memory indexes to perform similarity searches.",
    "desc2": "However, updating the index is non-trivial and requires vector workflow tools inherent in vector databases. And to top it off, building a solution to host vectors rapidly becomes costly when solving the scale requirement."
  },
  "features": {
    "title": "Milvus is a cloud-native, open-source vector database built to power embedding similarity search and AI applications.",
    "easy": {
      "title": "Easy to Use",
      "desc": "With Milvus vector database, you can create a large-scale similarity search service in less than a minute. Simple and intuitive SDKs are also available for a variety of different languages."
    },
    "fast": {
      "title": "Blazing Fast",
      "desc": "Milvus is hardware efficient and provides advanced indexing algorithms, achieving a 10x performance boost in retrieval speed."
    },
    "available": {
      "title": "Highly Available",
      "desc": "Milvus vector database has been battle-tested by over a thousand enterprise users in various use cases. With extensive isolation of individual system components, Milvus is highly resilient and reliable."
    },
    "scalable": {
      "title": "Highly Scalable",
      "desc": "Milvus's distributed and high-throughput nature makes it a natural fit for serving large-scale vector data."
    },
    "cloud": {
      "title": "Cloud-native",
      "desc": "The Milvus database adopts a systemic approach to cloud-nativity, separating compute from storage and allowing you to scale up and out."
    },
    "feature": {
      "title": "Feature-rich",
      "desc": " The Milvus vector search support various data types, attribute filtering, UDF support, configurable consistency level, time travel, and more."
    }
  },
  "mechanism": {
    "title": "How does Milvus Work?",
    "desc": "Milvus consists of a storage layer and a compute layer, and to enhance elasticity and flexibility, all components in Milvus are stateless. The system comprises of four levels:",
    "levels": {
      "accessLayer": {
        "title": "Access layer",
        "desc": "The access layer comprises a group of stateless proxies and serves as the front layer of the system and endpoint to users."
      },
      "coordinatorService": {
        "title": "Coordinator service",
        "desc": "The coordinator service assigns tasks to the worker nodes and functions as the system's brain."
      },
      "workerNodes": {
        "title": "Worker nodes",
        "desc": "The worker nodes function as arms and legs and are dumb executors that follow instructions from the coordinator service and execute user-triggered DML/DDL commands."
      },
      "storage": {
        "title": "Storage",
        "desc": "Storage is the bone of the system and is responsible for data persistence. It comprises meta storage, log broker, and object storage."
      }
    }
  },
  "applications": {
    "title": "What is Milvus Used For?",
    "desc": "Today, hundreds of Milvus use cases are commonly used to build similarity search-based applications. Any company that relies on or works with unstructured data can find numerous benefits.",
    "application": {
      "textSearch": {
        "title": "Semantic text search",
        "desc": "Processing and querying text across multiple vectors like intent, location, and previous search history can provide the context necessary for more accurate and nuanced results."
      },
      "advertising": {
        "title": "AI advertising",
        "desc": "Vector databases can be used in targeted advertising to improve the relevance and effectiveness of ad targeting. In this context, the database can store and index large amounts of data related to user behavior, demographics, and interests as high-dimensional vectors. Ads are then mapped to the same space as the users, making targeted advertising as simple as performing a query in Milvus."
      },
      "similaritySearch": {
        "title": "Video, audio, and image similarity search",
        "desc": "Discover similar videos, audio, and images within large datasets with our state-of-the-art similarity search options include Euclidean distance, cosine similarity, and Jaccard similarity."
      },
      "eCommerce": {
        "title": "Recommender system",
        "desc": "Vector databases such as Milvus can power product recommendation engines for e-commerce  by combining multiple sources of unstructured data such as search history and past purchases. Additionally, user-generated content of various formats can be stored as a single vector representation making recommending new content as easy as querying over content users have liked or engaged with previously."
      },
      "qaSystem": {
        "title": "Question answering system",
        "desc": "A question answering system is able to answer questions posed in natural language. These systems can be used for a variety of applications, including customer support, internal information retrieval, and more."
      },
      "newDrug": {
        "title": "AI drug discovery",
        "desc": "In drug discovery, vector representations of compounds include the overall structure and biological properties. A vector database can store and index this data as high-dimensional vectors, enabling new drug discovery simply by querying."
      }
    }
  },
  "keyResources": {
    "readMore": "Read More",
    "title": "Key Resources",
    "resources": [
      {
        "tagLine": "Whitepaper",
        "title": "Milvus Performance Evaluation 2023",
        "btnLabel": "Read More",
        "desc": "This is tutorial you will learn about text-based unstructured data.",
        "link": "/resources/milvus-performance-benchmark"
      },
      {
        "tagLine": "Compare",
        "title": "Open source vector databases",
        "desc": "Read these concepts and guides related to vector databases.",
        "btnLabel": "Learn More",
        "link": "/comparison"
      },
      {
        "tagLine": "Whitepaper",
        "title": "A Purpose-Built Vector Data Management System",
        "desc": "Flat indexing and inverted file (IVF) indexes are two basic indexing strategies.",
        "btnLabel": "Read More",
        "link": "/resources/milvus-vector-data-management-system"
      }
    ]
  }
}
